app/controllers/projects_controller.rb

  def index
    @projects = Project.where(user: current_user)
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1